RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Source/gd32h7xx_adc.c
    /* configure ADC regular sequence */
    if(rank < ADC_REGULAR_CHANNEL_RANK_ONE) {
        /* the regular group sequence rank is smaller than one */
        rsq = ADC_RSQ8(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH * rank)));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   rank));
        ADC_RSQ8(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_THREE) {
        /* the regular group sequence rank is smaller than three */
        rsq = ADC_RSQ7(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_ONE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_ONE)));
        ADC_RSQ7(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_FIVE) {
        /* the regular group sequence rank is smaller than five */
        rsq = ADC_RSQ6(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_THREE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_THREE)));
        ADC_RSQ6(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_SEVEN) {
        /* the regular group sequence rank is smaller than seven */
        rsq = ADC_RSQ5(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_FIVE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_FIVE)));
        ADC_RSQ5(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_NINE) {
        /* the regular group sequence rank is smaller than nine */
        rsq = ADC_RSQ4(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_SEVEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_SEVEN)));
        ADC_RSQ4(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_ELEVEN) {
        /* the regular group sequence rank is smaller than eleven */
        rsq = ADC_RSQ3(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_NINE))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_NINE)));
        ADC_RSQ3(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_THIRTEEN) {
        /* the regular group sequence rank is smaller than thirteen */
        rsq = ADC_RSQ2(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_ELEVEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_ELEVEN)));
        ADC_RSQ2(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_FIFTEEN) {
        /* the regular group sequence rank is smaller than fifteen */
        rsq = ADC_RSQ1(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_THIRTEEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_THIRTEEN)));
        ADC_RSQ1(adc_periph) = rsq;
    } else if(rank < ADC_REGULAR_CHANNEL_RANK_SIXTEEN) {
        /* the regular group sequence rank is smaller than sixteen */
        rsq = ADC_RSQ0(adc_periph);
        rsq &= ~((uint32_t)((ADC_RSQX_RSMPN | ADC_RSQX_RSQN) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                 (rank - ADC_REGULAR_CHANNEL_RANK_FIFTEEN))));
        rsq |= ((uint32_t)(SQX_SMP(sample_time) | adc_channel) << (ADC_REGULAR_CHANNEL_SHIFT_LENGTH *
                                                                   (rank - ADC_REGULAR_CHANNEL_RANK_FIFTEEN)));
        ADC_RSQ0(adc_periph) = rsq;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure ADC inserted channel
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  rank: the inserted group sequencer rank,this parameter must be between 0 to 3
    \param[in]  adc_channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_x(x=0..20): ADC Channelx
    \param[in]  sample_time: The sample time value, 0..809 for ADC0/ADC1, 0..638 for ADC2
    \param[out] none
    \retval     none
*/
void adc_inserted_channel_config(uint32_t adc_periph, uint8_t rank, uint8_t adc_channel, uint32_t sample_time)
{
    uint8_t inserted_length, rankx;
    uint32_t isq;

